back-end/app/controllers/api/v1/items_controller.rb

INSERT INTO "items" ("user_id", "name", "description", "imageUrl", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        item = Item.create(item_params)

UPDATE "items" SET "name" = $1, "imageUrl" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["name", "iphone 11 max"], ["imageUrl", "https://fdn2.gsmarena.com/vv/pics/apple/apple-iphone-pro-10.jpg"], ["updated_at", "2020-03-26 13:36:07.195150"], ["id", 10]]
---
    def update
        # item = Item.find_by(id: params[:id])
        @item.update(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 3]]
---
    def destroy
        item = Item.find_by(id: params[:id])
        item.destroy

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_item
        @item = Item.find_by(id: params[:id])