back-end/app/controllers/api/v1/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show

        review = Review.find_by(id: params[:id])

INSERT INTO "reviews" ("item_id", "user_id", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["item_id", 3], ["user_id", 1], ["comment", "nice"], ["created_at", "2020-03-26 17:02:05.134562"], ["updated_at", "2020-03-26 17:02:05.134562"]]
---
    def create
        review = Review.create(review_params)